Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GB002.h
#define _U1EP13_EPCONDIS_POSITION                0x00000004
#define _U1EP13_EPCONDIS_MASK                    0x00000010
#define _U1EP13_EPCONDIS_LENGTH                  0x00000001

#define _U1EP13_EPINEN_POSITION                  0x00000002
#define _U1EP13_EPINEN_MASK                      0x00000004
#define _U1EP13_EPINEN_LENGTH                    0x00000001

#define _U1EP13_EPOUTEN_POSITION                 0x00000003
#define _U1EP13_EPOUTEN_MASK                     0x00000008
#define _U1EP13_EPOUTEN_LENGTH                   0x00000001

#define _U1EP14_EPHSHK_POSITION                  0x00000000
#define _U1EP14_EPHSHK_MASK                      0x00000001
#define _U1EP14_EPHSHK_LENGTH                    0x00000001

#define _U1EP14_EPSTALL_POSITION                 0x00000001
#define _U1EP14_EPSTALL_MASK                     0x00000002
#define _U1EP14_EPSTALL_LENGTH                   0x00000001

#define _U1EP14_EPTXEN_POSITION                  0x00000002
#define _U1EP14_EPTXEN_MASK                      0x00000004
#define _U1EP14_EPTXEN_LENGTH                    0x00000001

#define _U1EP14_EPRXEN_POSITION                  0x00000003
#define _U1EP14_EPRXEN_MASK                      0x00000008
#define _U1EP14_EPRXEN_LENGTH                    0x00000001

#define _U1EP14_EPCONDIS_POSITION                0x00000004
#define _U1EP14_EPCONDIS_MASK                    0x00000010
#define _U1EP14_EPCONDIS_LENGTH                  0x00000001

#define _U1EP14_EPINEN_POSITION                  0x00000002
#define _U1EP14_EPINEN_MASK                      0x00000004
#define _U1EP14_EPINEN_LENGTH                    0x00000001

#define _U1EP14_EPOUTEN_POSITION                 0x00000003
#define _U1EP14_EPOUTEN_MASK                     0x00000008
#define _U1EP14_EPOUTEN_LENGTH                   0x00000001

#define _U1EP15_EPHSHK_POSITION                  0x00000000
#define _U1EP15_EPHSHK_MASK                      0x00000001
#define _U1EP15_EPHSHK_LENGTH                    0x00000001

#define _U1EP15_EPSTALL_POSITION                 0x00000001
#define _U1EP15_EPSTALL_MASK                     0x00000002
#define _U1EP15_EPSTALL_LENGTH                   0x00000001

#define _U1EP15_EPTXEN_POSITION                  0x00000002
#define _U1EP15_EPTXEN_MASK                      0x00000004
#define _U1EP15_EPTXEN_LENGTH                    0x00000001

#define _U1EP15_EPRXEN_POSITION                  0x00000003
#define _U1EP15_EPRXEN_MASK                      0x00000008
#define _U1EP15_EPRXEN_LENGTH                    0x00000001

#define _U1EP15_EPCONDIS_POSITION                0x00000004
#define _U1EP15_EPCONDIS_MASK                    0x00000010
#define _U1EP15_EPCONDIS_LENGTH                  0x00000001

#define _U1EP15_EPINEN_POSITION                  0x00000002
#define _U1EP15_EPINEN_MASK                      0x00000004
#define _U1EP15_EPINEN_LENGTH                    0x00000001

#define _U1EP15_EPOUTEN_POSITION                 0x00000003
#define _U1EP15_EPOUTEN_MASK                     0x00000008
#define _U1EP15_EPOUTEN_LENGTH                   0x00000001

#define _U1PWMRRS_PER_POSITION                   0x00000000
#define _U1PWMRRS_PER_MASK                       0x000000FF
#define _U1PWMRRS_PER_LENGTH                     0x00000008

#define _U1PWMRRS_DC_POSITION                    0x00000008
#define _U1PWMRRS_DC_MASK                        0x0000FF00
#define _U1PWMRRS_DC_LENGTH                      0x00000008

#define _U1PWMRRS_PER0_POSITION                  0x00000000
#define _U1PWMRRS_PER0_MASK                      0x00000001
#define _U1PWMRRS_PER0_LENGTH                    0x00000001

#define _U1PWMRRS_PER1_POSITION                  0x00000001
#define _U1PWMRRS_PER1_MASK                      0x00000002
#define _U1PWMRRS_PER1_LENGTH                    0x00000001

#define _U1PWMRRS_PER2_POSITION                  0x00000002
#define _U1PWMRRS_PER2_MASK                      0x00000004
#define _U1PWMRRS_PER2_LENGTH                    0x00000001

#define _U1PWMRRS_PER3_POSITION                  0x00000003
#define _U1PWMRRS_PER3_MASK                      0x00000008
#define _U1PWMRRS_PER3_LENGTH                    0x00000001

#define _U1PWMRRS_PER4_POSITION                  0x00000004
#define _U1PWMRRS_PER4_MASK                      0x00000010
#define _U1PWMRRS_PER4_LENGTH                    0x00000001

#define _U1PWMRRS_PER5_POSITION                  0x00000005
#define _U1PWMRRS_PER5_MASK                      0x00000020
#define _U1PWMRRS_PER5_LENGTH                    0x00000001

#define _U1PWMRRS_PER6_POSITION                  0x00000006
#define _U1PWMRRS_PER6_MASK                      0x00000040
#define _U1PWMRRS_PER6_LENGTH                    0x00000001

#define _U1PWMRRS_PER7_POSITION                  0x00000007
#define _U1PWMRRS_PER7_MASK                      0x00000080
#define _U1PWMRRS_PER7_LENGTH                    0x00000001

#define _U1PWMRRS_DC0_POSITION                   0x00000008
#define _U1PWMRRS_DC0_MASK                       0x00000100
#define _U1PWMRRS_DC0_LENGTH                     0x00000001

#define _U1PWMRRS_DC1_POSITION                   0x00000009
#define _U1PWMRRS_DC1_MASK                       0x00000200
#define _U1PWMRRS_DC1_LENGTH                     0x00000001

#define _U1PWMRRS_DC2_POSITION                   0x0000000A
#define _U1PWMRRS_DC2_MASK                       0x00000400
#define _U1PWMRRS_DC2_LENGTH                     0x00000001

#define _U1PWMRRS_DC3_POSITION                   0x0000000B
#define _U1PWMRRS_DC3_MASK                       0x00000800
#define _U1PWMRRS_DC3_LENGTH                     0x00000001

#define _U1PWMRRS_DC4_POSITION                   0x0000000C
#define _U1PWMRRS_DC4_MASK                       0x00001000
#define _U1PWMRRS_DC4_LENGTH                     0x00000001

#define _U1PWMRRS_DC5_POSITION                   0x0000000D
#define _U1PWMRRS_DC5_MASK                       0x00002000
#define _U1PWMRRS_DC5_LENGTH                     0x00000001

#define _U1PWMRRS_DC6_POSITION                   0x0000000E
#define _U1PWMRRS_DC6_MASK                       0x00004000
#define _U1PWMRRS_DC6_LENGTH                     0x00000001

#define _U1PWMRRS_DC7_POSITION                   0x0000000F
#define _U1PWMRRS_DC7_MASK                       0x00008000
#define _U1PWMRRS_DC7_LENGTH                     0x00000001

#define _U1PWMRRS_USBRS0_POSITION                0x00000000
#define _U1PWMRRS_USBRS0_MASK                    0x00000001
#define _U1PWMRRS_USBRS0_LENGTH                  0x00000001

#define _U1PWMRRS_USBRS1_POSITION                0x00000001
#define _U1PWMRRS_USBRS1_MASK                    0x00000002
#define _U1PWMRRS_USBRS1_LENGTH                  0x00000001

#define _U1PWMRRS_USBRS2_POSITION                0x00000002
#define _U1PWMRRS_USBRS2_MASK                    0x00000004
#define _U1PWMRRS_USBRS2_LENGTH                  0x00000001

#define _U1PWMRRS_USBRS3_POSITION                0x00000003
#define _U1PWMRRS_USBRS3_MASK                    0x00000008
#define _U1PWMRRS_USBRS3_LENGTH                  0x00000001

