Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GB002.h
#define _U1PWMRRS_USBRS4_POSITION                0x00000004
#define _U1PWMRRS_USBRS4_MASK                    0x00000010
#define _U1PWMRRS_USBRS4_LENGTH                  0x00000001

#define _U1PWMRRS_USBRS5_POSITION                0x00000005
#define _U1PWMRRS_USBRS5_MASK                    0x00000020
#define _U1PWMRRS_USBRS5_LENGTH                  0x00000001

#define _U1PWMRRS_USBRS6_POSITION                0x00000006
#define _U1PWMRRS_USBRS6_MASK                    0x00000040
#define _U1PWMRRS_USBRS6_LENGTH                  0x00000001

#define _U1PWMRRS_USBRS7_POSITION                0x00000007
#define _U1PWMRRS_USBRS7_MASK                    0x00000080
#define _U1PWMRRS_USBRS7_LENGTH                  0x00000001

#define _U1PWMRRS_USBR0_POSITION                 0x00000008
#define _U1PWMRRS_USBR0_MASK                     0x00000100
#define _U1PWMRRS_USBR0_LENGTH                   0x00000001

#define _U1PWMRRS_USBR1_POSITION                 0x00000009
#define _U1PWMRRS_USBR1_MASK                     0x00000200
#define _U1PWMRRS_USBR1_LENGTH                   0x00000001

#define _U1PWMRRS_USBR2_POSITION                 0x0000000A
#define _U1PWMRRS_USBR2_MASK                     0x00000400
#define _U1PWMRRS_USBR2_LENGTH                   0x00000001

#define _U1PWMRRS_USBR3_POSITION                 0x0000000B
#define _U1PWMRRS_USBR3_MASK                     0x00000800
#define _U1PWMRRS_USBR3_LENGTH                   0x00000001

#define _U1PWMRRS_USBR4_POSITION                 0x0000000C
#define _U1PWMRRS_USBR4_MASK                     0x00001000
#define _U1PWMRRS_USBR4_LENGTH                   0x00000001

#define _U1PWMRRS_USBR5_POSITION                 0x0000000D
#define _U1PWMRRS_USBR5_MASK                     0x00002000
#define _U1PWMRRS_USBR5_LENGTH                   0x00000001

#define _U1PWMRRS_USBR6_POSITION                 0x0000000E
#define _U1PWMRRS_USBR6_MASK                     0x00004000
#define _U1PWMRRS_USBR6_LENGTH                   0x00000001

#define _U1PWMRRS_USBR7_POSITION                 0x0000000F
#define _U1PWMRRS_USBR7_MASK                     0x00008000
#define _U1PWMRRS_USBR7_LENGTH                   0x00000001

#define _U1PWMRRS_USBRS_POSITION                 0x00000000
#define _U1PWMRRS_USBRS_MASK                     0x000000FF
#define _U1PWMRRS_USBRS_LENGTH                   0x00000008

#define _U1PWMRRS_USBR_POSITION                  0x00000008
#define _U1PWMRRS_USBR_MASK                      0x0000FF00
#define _U1PWMRRS_USBR_LENGTH                    0x00000008

#define _U1PWMCON_CNTEN_POSITION                 0x00000008
#define _U1PWMCON_CNTEN_MASK                     0x00000100
#define _U1PWMCON_CNTEN_LENGTH                   0x00000001

#define _U1PWMCON_PWMPOL_POSITION                0x00000009
#define _U1PWMCON_PWMPOL_MASK                    0x00000200
#define _U1PWMCON_PWMPOL_LENGTH                  0x00000001

#define _U1PWMCON_PWMEN_POSITION                 0x0000000F
#define _U1PWMCON_PWMEN_MASK                     0x00008000
#define _U1PWMCON_PWMEN_LENGTH                   0x00000001

#define _PMCON_RDSP_POSITION                     0x00000000
#define _PMCON_RDSP_MASK                         0x00000001
#define _PMCON_RDSP_LENGTH                       0x00000001

#define _PMCON_WRSP_POSITION                     0x00000001
#define _PMCON_WRSP_MASK                         0x00000002
#define _PMCON_WRSP_LENGTH                       0x00000001

#define _PMCON_BEP_POSITION                      0x00000002
#define _PMCON_BEP_MASK                          0x00000004
#define _PMCON_BEP_LENGTH                        0x00000001

#define _PMCON_CS1P_POSITION                     0x00000003
#define _PMCON_CS1P_MASK                         0x00000008
#define _PMCON_CS1P_LENGTH                       0x00000001

#define _PMCON_ALP_POSITION                      0x00000005
#define _PMCON_ALP_MASK                          0x00000020
#define _PMCON_ALP_LENGTH                        0x00000001

#define _PMCON_CSF_POSITION                      0x00000006
#define _PMCON_CSF_MASK                          0x000000C0
#define _PMCON_CSF_LENGTH                        0x00000002

#define _PMCON_PTRDEN_POSITION                   0x00000008
#define _PMCON_PTRDEN_MASK                       0x00000100
#define _PMCON_PTRDEN_LENGTH                     0x00000001

#define _PMCON_PTWREN_POSITION                   0x00000009
#define _PMCON_PTWREN_MASK                       0x00000200
#define _PMCON_PTWREN_LENGTH                     0x00000001

#define _PMCON_PTBEEN_POSITION                   0x0000000A
#define _PMCON_PTBEEN_MASK                       0x00000400
#define _PMCON_PTBEEN_LENGTH                     0x00000001

#define _PMCON_ADRMUX_POSITION                   0x0000000B
#define _PMCON_ADRMUX_MASK                       0x00001800
#define _PMCON_ADRMUX_LENGTH                     0x00000002

#define _PMCON_PSIDL_POSITION                    0x0000000D
#define _PMCON_PSIDL_MASK                        0x00002000
#define _PMCON_PSIDL_LENGTH                      0x00000001

#define _PMCON_PMPEN_POSITION                    0x0000000F
#define _PMCON_PMPEN_MASK                        0x00008000
#define _PMCON_PMPEN_LENGTH                      0x00000001

#define _PMCON_CSF0_POSITION                     0x00000006
#define _PMCON_CSF0_MASK                         0x00000040
#define _PMCON_CSF0_LENGTH                       0x00000001

#define _PMCON_CSF1_POSITION                     0x00000007
#define _PMCON_CSF1_MASK                         0x00000080
#define _PMCON_CSF1_LENGTH                       0x00000001

#define _PMCON_ADRMUX0_POSITION                  0x0000000B
#define _PMCON_ADRMUX0_MASK                      0x00000800
#define _PMCON_ADRMUX0_LENGTH                    0x00000001

#define _PMCON_ADRMUX1_POSITION                  0x0000000C
#define _PMCON_ADRMUX1_MASK                      0x00001000
#define _PMCON_ADRMUX1_LENGTH                    0x00000001

#define _PMMODE_WAITE_POSITION                   0x00000000
#define _PMMODE_WAITE_MASK                       0x00000003
#define _PMMODE_WAITE_LENGTH                     0x00000002

